GopalSaraf/Practicals/PSDL/include/proc/pic18c858.inc
// Register: RXB0EIDL
#define RXB0EIDL RXB0EIDL
RXB0EIDL                                 equ 0F64h
// bitfield definitions
RXB0EIDL_EID0_POSN                       equ 0000h
RXB0EIDL_EID0_POSITION                   equ 0000h
RXB0EIDL_EID0_SIZE                       equ 0001h
RXB0EIDL_EID0_LENGTH                     equ 0001h
RXB0EIDL_EID0_MASK                       equ 0001h
RXB0EIDL_EID1_POSN                       equ 0001h
RXB0EIDL_EID1_POSITION                   equ 0001h
RXB0EIDL_EID1_SIZE                       equ 0001h
RXB0EIDL_EID1_LENGTH                     equ 0001h
RXB0EIDL_EID1_MASK                       equ 0002h
RXB0EIDL_EID2_POSN                       equ 0002h
RXB0EIDL_EID2_POSITION                   equ 0002h
RXB0EIDL_EID2_SIZE                       equ 0001h
RXB0EIDL_EID2_LENGTH                     equ 0001h
RXB0EIDL_EID2_MASK                       equ 0004h
RXB0EIDL_EID3_POSN                       equ 0003h
RXB0EIDL_EID3_POSITION                   equ 0003h
RXB0EIDL_EID3_SIZE                       equ 0001h
RXB0EIDL_EID3_LENGTH                     equ 0001h
RXB0EIDL_EID3_MASK                       equ 0008h
RXB0EIDL_EID4_POSN                       equ 0004h
RXB0EIDL_EID4_POSITION                   equ 0004h
RXB0EIDL_EID4_SIZE                       equ 0001h
RXB0EIDL_EID4_LENGTH                     equ 0001h
RXB0EIDL_EID4_MASK                       equ 0010h
RXB0EIDL_EID5_POSN                       equ 0005h
RXB0EIDL_EID5_POSITION                   equ 0005h
RXB0EIDL_EID5_SIZE                       equ 0001h
RXB0EIDL_EID5_LENGTH                     equ 0001h
RXB0EIDL_EID5_MASK                       equ 0020h
RXB0EIDL_EID6_POSN                       equ 0006h
RXB0EIDL_EID6_POSITION                   equ 0006h
RXB0EIDL_EID6_SIZE                       equ 0001h
RXB0EIDL_EID6_LENGTH                     equ 0001h
RXB0EIDL_EID6_MASK                       equ 0040h
RXB0EIDL_EID7_POSN                       equ 0007h
RXB0EIDL_EID7_POSITION                   equ 0007h
RXB0EIDL_EID7_SIZE                       equ 0001h
RXB0EIDL_EID7_LENGTH                     equ 0001h
RXB0EIDL_EID7_MASK                       equ 0080h
RXB0EIDL_RXB0EID0_POSN                   equ 0000h
RXB0EIDL_RXB0EID0_POSITION               equ 0000h
RXB0EIDL_RXB0EID0_SIZE                   equ 0001h
RXB0EIDL_RXB0EID0_LENGTH                 equ 0001h
RXB0EIDL_RXB0EID0_MASK                   equ 0001h
RXB0EIDL_RXB0EID1_POSN                   equ 0001h
RXB0EIDL_RXB0EID1_POSITION               equ 0001h
RXB0EIDL_RXB0EID1_SIZE                   equ 0001h
RXB0EIDL_RXB0EID1_LENGTH                 equ 0001h
RXB0EIDL_RXB0EID1_MASK                   equ 0002h
RXB0EIDL_RXB0EID2_POSN                   equ 0002h
RXB0EIDL_RXB0EID2_POSITION               equ 0002h
RXB0EIDL_RXB0EID2_SIZE                   equ 0001h
RXB0EIDL_RXB0EID2_LENGTH                 equ 0001h
RXB0EIDL_RXB0EID2_MASK                   equ 0004h
RXB0EIDL_RXB0EID3_POSN                   equ 0003h
RXB0EIDL_RXB0EID3_POSITION               equ 0003h
RXB0EIDL_RXB0EID3_SIZE                   equ 0001h
RXB0EIDL_RXB0EID3_LENGTH                 equ 0001h
RXB0EIDL_RXB0EID3_MASK                   equ 0008h
RXB0EIDL_RXB0EID4_POSN                   equ 0004h
RXB0EIDL_RXB0EID4_POSITION               equ 0004h
RXB0EIDL_RXB0EID4_SIZE                   equ 0001h
RXB0EIDL_RXB0EID4_LENGTH                 equ 0001h
RXB0EIDL_RXB0EID4_MASK                   equ 0010h
RXB0EIDL_RXB0EID5_POSN                   equ 0005h
RXB0EIDL_RXB0EID5_POSITION               equ 0005h
RXB0EIDL_RXB0EID5_SIZE                   equ 0001h
RXB0EIDL_RXB0EID5_LENGTH                 equ 0001h
RXB0EIDL_RXB0EID5_MASK                   equ 0020h
RXB0EIDL_RXB0EID6_POSN                   equ 0006h
RXB0EIDL_RXB0EID6_POSITION               equ 0006h
RXB0EIDL_RXB0EID6_SIZE                   equ 0001h
RXB0EIDL_RXB0EID6_LENGTH                 equ 0001h
RXB0EIDL_RXB0EID6_MASK                   equ 0040h
RXB0EIDL_RXB0EID7_POSN                   equ 0007h
RXB0EIDL_RXB0EID7_POSITION               equ 0007h
RXB0EIDL_RXB0EID7_SIZE                   equ 0001h
RXB0EIDL_RXB0EID7_LENGTH                 equ 0001h
RXB0EIDL_RXB0EID7_MASK                   equ 0080h

// Register: RXB0DLC
#define RXB0DLC RXB0DLC
RXB0DLC                                  equ 0F65h
// bitfield definitions
RXB0DLC_DLC0_POSN                        equ 0000h
RXB0DLC_DLC0_POSITION                    equ 0000h
RXB0DLC_DLC0_SIZE                        equ 0001h
RXB0DLC_DLC0_LENGTH                      equ 0001h
RXB0DLC_DLC0_MASK                        equ 0001h
RXB0DLC_DLC1_POSN                        equ 0001h
RXB0DLC_DLC1_POSITION                    equ 0001h
RXB0DLC_DLC1_SIZE                        equ 0001h
RXB0DLC_DLC1_LENGTH                      equ 0001h
RXB0DLC_DLC1_MASK                        equ 0002h
RXB0DLC_DLC2_POSN                        equ 0002h
RXB0DLC_DLC2_POSITION                    equ 0002h
RXB0DLC_DLC2_SIZE                        equ 0001h
RXB0DLC_DLC2_LENGTH                      equ 0001h
RXB0DLC_DLC2_MASK                        equ 0004h
RXB0DLC_DLC3_POSN                        equ 0003h
RXB0DLC_DLC3_POSITION                    equ 0003h
RXB0DLC_DLC3_SIZE                        equ 0001h
RXB0DLC_DLC3_LENGTH                      equ 0001h
RXB0DLC_DLC3_MASK                        equ 0008h
RXB0DLC_RESB0_POSN                       equ 0004h
RXB0DLC_RESB0_POSITION                   equ 0004h
RXB0DLC_RESB0_SIZE                       equ 0001h
RXB0DLC_RESB0_LENGTH                     equ 0001h
RXB0DLC_RESB0_MASK                       equ 0010h
RXB0DLC_RESB1_POSN                       equ 0005h
RXB0DLC_RESB1_POSITION                   equ 0005h
RXB0DLC_RESB1_SIZE                       equ 0001h
RXB0DLC_RESB1_LENGTH                     equ 0001h
RXB0DLC_RESB1_MASK                       equ 0020h
RXB0DLC_RXRTR_POSN                       equ 0006h
RXB0DLC_RXRTR_POSITION                   equ 0006h
RXB0DLC_RXRTR_SIZE                       equ 0001h
RXB0DLC_RXRTR_LENGTH                     equ 0001h
RXB0DLC_RXRTR_MASK                       equ 0040h
RXB0DLC_DCL0_POSN                        equ 0000h
RXB0DLC_DCL0_POSITION                    equ 0000h
RXB0DLC_DCL0_SIZE                        equ 0001h
RXB0DLC_DCL0_LENGTH                      equ 0001h
RXB0DLC_DCL0_MASK                        equ 0001h
RXB0DLC_RTR_POSN                         equ 0006h
RXB0DLC_RTR_POSITION                     equ 0006h
RXB0DLC_RTR_SIZE                         equ 0001h
RXB0DLC_RTR_LENGTH                       equ 0001h
RXB0DLC_RTR_MASK                         equ 0040h
RXB0DLC_RXB0DLC0_POSN                    equ 0000h
RXB0DLC_RXB0DLC0_POSITION                equ 0000h
RXB0DLC_RXB0DLC0_SIZE                    equ 0001h
RXB0DLC_RXB0DLC0_LENGTH                  equ 0001h
RXB0DLC_RXB0DLC0_MASK                    equ 0001h
RXB0DLC_RXB0DLC1_POSN                    equ 0001h
RXB0DLC_RXB0DLC1_POSITION                equ 0001h
RXB0DLC_RXB0DLC1_SIZE                    equ 0001h
RXB0DLC_RXB0DLC1_LENGTH                  equ 0001h
RXB0DLC_RXB0DLC1_MASK                    equ 0002h
RXB0DLC_RXB0DLC2_POSN                    equ 0002h
RXB0DLC_RXB0DLC2_POSITION                equ 0002h
RXB0DLC_RXB0DLC2_SIZE                    equ 0001h
RXB0DLC_RXB0DLC2_LENGTH                  equ 0001h
RXB0DLC_RXB0DLC2_MASK                    equ 0004h
RXB0DLC_RXB0DLC3_POSN                    equ 0003h
RXB0DLC_RXB0DLC3_POSITION                equ 0003h
RXB0DLC_RXB0DLC3_SIZE                    equ 0001h
RXB0DLC_RXB0DLC3_LENGTH                  equ 0001h
RXB0DLC_RXB0DLC3_MASK                    equ 0008h
RXB0DLC_RXB0RB0_POSN                     equ 0004h
RXB0DLC_RXB0RB0_POSITION                 equ 0004h
RXB0DLC_RXB0RB0_SIZE                     equ 0001h
RXB0DLC_RXB0RB0_LENGTH                   equ 0001h
RXB0DLC_RXB0RB0_MASK                     equ 0010h
RXB0DLC_RXB0RB1_POSN                     equ 0005h
RXB0DLC_RXB0RB1_POSITION                 equ 0005h
RXB0DLC_RXB0RB1_SIZE                     equ 0001h
RXB0DLC_RXB0RB1_LENGTH                   equ 0001h
RXB0DLC_RXB0RB1_MASK                     equ 0020h
RXB0DLC_RXB0RTR_POSN                     equ 0006h
RXB0DLC_RXB0RTR_POSITION                 equ 0006h
RXB0DLC_RXB0RTR_SIZE                     equ 0001h
RXB0DLC_RXB0RTR_LENGTH                   equ 0001h
RXB0DLC_RXB0RTR_MASK                     equ 0040h

// Register: RXB0D0
#define RXB0D0 RXB0D0
RXB0D0                                   equ 0F66h
// bitfield definitions
RXB0D0_RXB0D00_POSN                      equ 0000h
RXB0D0_RXB0D00_POSITION                  equ 0000h
RXB0D0_RXB0D00_SIZE                      equ 0001h
RXB0D0_RXB0D00_LENGTH                    equ 0001h
RXB0D0_RXB0D00_MASK                      equ 0001h
RXB0D0_RXB0D01_POSN                      equ 0001h
RXB0D0_RXB0D01_POSITION                  equ 0001h
RXB0D0_RXB0D01_SIZE                      equ 0001h
RXB0D0_RXB0D01_LENGTH                    equ 0001h
RXB0D0_RXB0D01_MASK                      equ 0002h
RXB0D0_RXB0D02_POSN                      equ 0002h
RXB0D0_RXB0D02_POSITION                  equ 0002h
RXB0D0_RXB0D02_SIZE                      equ 0001h
RXB0D0_RXB0D02_LENGTH                    equ 0001h
RXB0D0_RXB0D02_MASK                      equ 0004h
RXB0D0_RXB0D03_POSN                      equ 0003h
RXB0D0_RXB0D03_POSITION                  equ 0003h
RXB0D0_RXB0D03_SIZE                      equ 0001h
RXB0D0_RXB0D03_LENGTH                    equ 0001h
RXB0D0_RXB0D03_MASK                      equ 0008h
RXB0D0_RXB0D04_POSN                      equ 0004h
RXB0D0_RXB0D04_POSITION                  equ 0004h
RXB0D0_RXB0D04_SIZE                      equ 0001h
RXB0D0_RXB0D04_LENGTH                    equ 0001h
RXB0D0_RXB0D04_MASK                      equ 0010h
RXB0D0_RXB0D05_POSN                      equ 0005h
RXB0D0_RXB0D05_POSITION                  equ 0005h
RXB0D0_RXB0D05_SIZE                      equ 0001h
RXB0D0_RXB0D05_LENGTH                    equ 0001h
RXB0D0_RXB0D05_MASK                      equ 0020h
RXB0D0_RXB0D06_POSN                      equ 0006h
RXB0D0_RXB0D06_POSITION                  equ 0006h
RXB0D0_RXB0D06_SIZE                      equ 0001h
RXB0D0_RXB0D06_LENGTH                    equ 0001h
RXB0D0_RXB0D06_MASK                      equ 0040h
RXB0D0_RXB0D07_POSN                      equ 0007h
RXB0D0_RXB0D07_POSITION                  equ 0007h
RXB0D0_RXB0D07_SIZE                      equ 0001h
RXB0D0_RXB0D07_LENGTH                    equ 0001h
RXB0D0_RXB0D07_MASK                      equ 0080h
RXB0D0_RB0D00_POSN                       equ 0000h
RXB0D0_RB0D00_POSITION                   equ 0000h
RXB0D0_RB0D00_SIZE                       equ 0001h
RXB0D0_RB0D00_LENGTH                     equ 0001h
RXB0D0_RB0D00_MASK                       equ 0001h
RXB0D0_RB0D01_POSN                       equ 0001h
RXB0D0_RB0D01_POSITION                   equ 0001h
RXB0D0_RB0D01_SIZE                       equ 0001h
RXB0D0_RB0D01_LENGTH                     equ 0001h
RXB0D0_RB0D01_MASK                       equ 0002h
RXB0D0_RB0D02_POSN                       equ 0002h
RXB0D0_RB0D02_POSITION                   equ 0002h
RXB0D0_RB0D02_SIZE                       equ 0001h
RXB0D0_RB0D02_LENGTH                     equ 0001h
RXB0D0_RB0D02_MASK                       equ 0004h
RXB0D0_RB0D03_POSN                       equ 0003h
RXB0D0_RB0D03_POSITION                   equ 0003h
RXB0D0_RB0D03_SIZE                       equ 0001h
RXB0D0_RB0D03_LENGTH                     equ 0001h
RXB0D0_RB0D03_MASK                       equ 0008h
RXB0D0_RB0D04_POSN                       equ 0004h
RXB0D0_RB0D04_POSITION                   equ 0004h
RXB0D0_RB0D04_SIZE                       equ 0001h
RXB0D0_RB0D04_LENGTH                     equ 0001h
RXB0D0_RB0D04_MASK                       equ 0010h
RXB0D0_RB0D05_POSN                       equ 0005h
RXB0D0_RB0D05_POSITION                   equ 0005h
RXB0D0_RB0D05_SIZE                       equ 0001h
RXB0D0_RB0D05_LENGTH                     equ 0001h
RXB0D0_RB0D05_MASK                       equ 0020h
RXB0D0_RB0D06_POSN                       equ 0006h
RXB0D0_RB0D06_POSITION                   equ 0006h
RXB0D0_RB0D06_SIZE                       equ 0001h
RXB0D0_RB0D06_LENGTH                     equ 0001h
RXB0D0_RB0D06_MASK                       equ 0040h
RXB0D0_RB0D07_POSN                       equ 0007h
RXB0D0_RB0D07_POSITION                   equ 0007h
RXB0D0_RB0D07_SIZE                       equ 0001h
RXB0D0_RB0D07_LENGTH                     equ 0001h
RXB0D0_RB0D07_MASK                       equ 0080h

// Register: RXB0D1
#define RXB0D1 RXB0D1
RXB0D1                                   equ 0F67h
// bitfield definitions
RXB0D1_RXB0D10_POSN                      equ 0000h
RXB0D1_RXB0D10_POSITION                  equ 0000h
RXB0D1_RXB0D10_SIZE                      equ 0001h
RXB0D1_RXB0D10_LENGTH                    equ 0001h
RXB0D1_RXB0D10_MASK                      equ 0001h
RXB0D1_RXB0D11_POSN                      equ 0001h
RXB0D1_RXB0D11_POSITION                  equ 0001h
RXB0D1_RXB0D11_SIZE                      equ 0001h
RXB0D1_RXB0D11_LENGTH                    equ 0001h
RXB0D1_RXB0D11_MASK                      equ 0002h
RXB0D1_RXB0D12_POSN                      equ 0002h
RXB0D1_RXB0D12_POSITION                  equ 0002h
RXB0D1_RXB0D12_SIZE                      equ 0001h
RXB0D1_RXB0D12_LENGTH                    equ 0001h
RXB0D1_RXB0D12_MASK                      equ 0004h
RXB0D1_RXB0D13_POSN                      equ 0003h
RXB0D1_RXB0D13_POSITION                  equ 0003h
RXB0D1_RXB0D13_SIZE                      equ 0001h
RXB0D1_RXB0D13_LENGTH                    equ 0001h
RXB0D1_RXB0D13_MASK                      equ 0008h
RXB0D1_RXB0D14_POSN                      equ 0004h
RXB0D1_RXB0D14_POSITION                  equ 0004h
RXB0D1_RXB0D14_SIZE                      equ 0001h
RXB0D1_RXB0D14_LENGTH                    equ 0001h
RXB0D1_RXB0D14_MASK                      equ 0010h
RXB0D1_RXB0D15_POSN                      equ 0005h
RXB0D1_RXB0D15_POSITION                  equ 0005h
RXB0D1_RXB0D15_SIZE                      equ 0001h
RXB0D1_RXB0D15_LENGTH                    equ 0001h
RXB0D1_RXB0D15_MASK                      equ 0020h
RXB0D1_RXB0D16_POSN                      equ 0006h
RXB0D1_RXB0D16_POSITION                  equ 0006h
RXB0D1_RXB0D16_SIZE                      equ 0001h
RXB0D1_RXB0D16_LENGTH                    equ 0001h
RXB0D1_RXB0D16_MASK                      equ 0040h
RXB0D1_RXB0D17_POSN                      equ 0007h
RXB0D1_RXB0D17_POSITION                  equ 0007h
RXB0D1_RXB0D17_SIZE                      equ 0001h
RXB0D1_RXB0D17_LENGTH                    equ 0001h
RXB0D1_RXB0D17_MASK                      equ 0080h
RXB0D1_RB0D10_POSN                       equ 0000h
RXB0D1_RB0D10_POSITION                   equ 0000h
RXB0D1_RB0D10_SIZE                       equ 0001h
RXB0D1_RB0D10_LENGTH                     equ 0001h
RXB0D1_RB0D10_MASK                       equ 0001h
RXB0D1_RB0D11_POSN                       equ 0001h
RXB0D1_RB0D11_POSITION                   equ 0001h
RXB0D1_RB0D11_SIZE                       equ 0001h
RXB0D1_RB0D11_LENGTH                     equ 0001h
RXB0D1_RB0D11_MASK                       equ 0002h
RXB0D1_RB0D12_POSN                       equ 0002h
RXB0D1_RB0D12_POSITION                   equ 0002h
RXB0D1_RB0D12_SIZE                       equ 0001h
RXB0D1_RB0D12_LENGTH                     equ 0001h
RXB0D1_RB0D12_MASK                       equ 0004h
RXB0D1_RB0D13_POSN                       equ 0003h
RXB0D1_RB0D13_POSITION                   equ 0003h
RXB0D1_RB0D13_SIZE                       equ 0001h
RXB0D1_RB0D13_LENGTH                     equ 0001h
RXB0D1_RB0D13_MASK                       equ 0008h
RXB0D1_RB0D14_POSN                       equ 0004h
RXB0D1_RB0D14_POSITION                   equ 0004h
RXB0D1_RB0D14_SIZE                       equ 0001h
RXB0D1_RB0D14_LENGTH                     equ 0001h
RXB0D1_RB0D14_MASK                       equ 0010h
RXB0D1_RB0D15_POSN                       equ 0005h
RXB0D1_RB0D15_POSITION                   equ 0005h
RXB0D1_RB0D15_SIZE                       equ 0001h
RXB0D1_RB0D15_LENGTH                     equ 0001h
RXB0D1_RB0D15_MASK                       equ 0020h
RXB0D1_RB0D16_POSN                       equ 0006h
RXB0D1_RB0D16_POSITION                   equ 0006h
RXB0D1_RB0D16_SIZE                       equ 0001h
RXB0D1_RB0D16_LENGTH                     equ 0001h
RXB0D1_RB0D16_MASK                       equ 0040h
RXB0D1_RB0D17_POSN                       equ 0007h
RXB0D1_RB0D17_POSITION                   equ 0007h
RXB0D1_RB0D17_SIZE                       equ 0001h
RXB0D1_RB0D17_LENGTH                     equ 0001h
RXB0D1_RB0D17_MASK                       equ 0080h

// Register: RXB0D2
#define RXB0D2 RXB0D2
RXB0D2                                   equ 0F68h
// bitfield definitions
RXB0D2_RXB0D20_POSN                      equ 0000h
RXB0D2_RXB0D20_POSITION                  equ 0000h
RXB0D2_RXB0D20_SIZE                      equ 0001h
RXB0D2_RXB0D20_LENGTH                    equ 0001h
RXB0D2_RXB0D20_MASK                      equ 0001h
RXB0D2_RXB0D21_POSN                      equ 0001h
RXB0D2_RXB0D21_POSITION                  equ 0001h
RXB0D2_RXB0D21_SIZE                      equ 0001h
RXB0D2_RXB0D21_LENGTH                    equ 0001h
RXB0D2_RXB0D21_MASK                      equ 0002h
RXB0D2_RXB0D22_POSN                      equ 0002h
RXB0D2_RXB0D22_POSITION                  equ 0002h
RXB0D2_RXB0D22_SIZE                      equ 0001h
RXB0D2_RXB0D22_LENGTH                    equ 0001h
RXB0D2_RXB0D22_MASK                      equ 0004h
RXB0D2_RXB0D23_POSN                      equ 0003h
RXB0D2_RXB0D23_POSITION                  equ 0003h
RXB0D2_RXB0D23_SIZE                      equ 0001h
RXB0D2_RXB0D23_LENGTH                    equ 0001h
RXB0D2_RXB0D23_MASK                      equ 0008h
RXB0D2_RXB0D24_POSN                      equ 0004h
RXB0D2_RXB0D24_POSITION                  equ 0004h
RXB0D2_RXB0D24_SIZE                      equ 0001h
RXB0D2_RXB0D24_LENGTH                    equ 0001h
RXB0D2_RXB0D24_MASK                      equ 0010h
RXB0D2_RXB0D25_POSN                      equ 0005h
RXB0D2_RXB0D25_POSITION                  equ 0005h
RXB0D2_RXB0D25_SIZE                      equ 0001h
RXB0D2_RXB0D25_LENGTH                    equ 0001h
RXB0D2_RXB0D25_MASK                      equ 0020h
RXB0D2_RXB0D26_POSN                      equ 0006h
RXB0D2_RXB0D26_POSITION                  equ 0006h
RXB0D2_RXB0D26_SIZE                      equ 0001h
RXB0D2_RXB0D26_LENGTH                    equ 0001h
RXB0D2_RXB0D26_MASK                      equ 0040h
RXB0D2_RXB0D27_POSN                      equ 0007h
RXB0D2_RXB0D27_POSITION                  equ 0007h
RXB0D2_RXB0D27_SIZE                      equ 0001h
RXB0D2_RXB0D27_LENGTH                    equ 0001h
RXB0D2_RXB0D27_MASK                      equ 0080h
RXB0D2_RB0D20_POSN                       equ 0000h
RXB0D2_RB0D20_POSITION                   equ 0000h
RXB0D2_RB0D20_SIZE                       equ 0001h
RXB0D2_RB0D20_LENGTH                     equ 0001h
RXB0D2_RB0D20_MASK                       equ 0001h
RXB0D2_RB0D21_POSN                       equ 0001h
RXB0D2_RB0D21_POSITION                   equ 0001h
RXB0D2_RB0D21_SIZE                       equ 0001h
RXB0D2_RB0D21_LENGTH                     equ 0001h
RXB0D2_RB0D21_MASK                       equ 0002h
RXB0D2_RB0D22_POSN                       equ 0002h
RXB0D2_RB0D22_POSITION                   equ 0002h
RXB0D2_RB0D22_SIZE                       equ 0001h
RXB0D2_RB0D22_LENGTH                     equ 0001h
RXB0D2_RB0D22_MASK                       equ 0004h
RXB0D2_RB0D23_POSN                       equ 0003h
RXB0D2_RB0D23_POSITION                   equ 0003h
RXB0D2_RB0D23_SIZE                       equ 0001h
RXB0D2_RB0D23_LENGTH                     equ 0001h
RXB0D2_RB0D23_MASK                       equ 0008h
RXB0D2_RB0D24_POSN                       equ 0004h
RXB0D2_RB0D24_POSITION                   equ 0004h
RXB0D2_RB0D24_SIZE                       equ 0001h
RXB0D2_RB0D24_LENGTH                     equ 0001h
RXB0D2_RB0D24_MASK                       equ 0010h
RXB0D2_RB0D25_POSN                       equ 0005h
RXB0D2_RB0D25_POSITION                   equ 0005h
RXB0D2_RB0D25_SIZE                       equ 0001h
RXB0D2_RB0D25_LENGTH                     equ 0001h
RXB0D2_RB0D25_MASK                       equ 0020h
RXB0D2_RB0D26_POSN                       equ 0006h
RXB0D2_RB0D26_POSITION                   equ 0006h
RXB0D2_RB0D26_SIZE                       equ 0001h
RXB0D2_RB0D26_LENGTH                     equ 0001h
RXB0D2_RB0D26_MASK                       equ 0040h
RXB0D2_RB0D27_POSN                       equ 0007h
RXB0D2_RB0D27_POSITION                   equ 0007h
RXB0D2_RB0D27_SIZE                       equ 0001h
RXB0D2_RB0D27_LENGTH                     equ 0001h
RXB0D2_RB0D27_MASK                       equ 0080h

