GopalSaraf/Practicals/PSDL/include/proc/pic18c858.inc
// Register: BRGCON1
#define BRGCON1 BRGCON1
BRGCON1                                  equ 0F70h
// bitfield definitions
BRGCON1_BRP0_POSN                        equ 0000h
BRGCON1_BRP0_POSITION                    equ 0000h
BRGCON1_BRP0_SIZE                        equ 0001h
BRGCON1_BRP0_LENGTH                      equ 0001h
BRGCON1_BRP0_MASK                        equ 0001h
BRGCON1_BRP1_POSN                        equ 0001h
BRGCON1_BRP1_POSITION                    equ 0001h
BRGCON1_BRP1_SIZE                        equ 0001h
BRGCON1_BRP1_LENGTH                      equ 0001h
BRGCON1_BRP1_MASK                        equ 0002h
BRGCON1_BRP2_POSN                        equ 0002h
BRGCON1_BRP2_POSITION                    equ 0002h
BRGCON1_BRP2_SIZE                        equ 0001h
BRGCON1_BRP2_LENGTH                      equ 0001h
BRGCON1_BRP2_MASK                        equ 0004h
BRGCON1_BRP3_POSN                        equ 0003h
BRGCON1_BRP3_POSITION                    equ 0003h
BRGCON1_BRP3_SIZE                        equ 0001h
BRGCON1_BRP3_LENGTH                      equ 0001h
BRGCON1_BRP3_MASK                        equ 0008h
BRGCON1_BRP4_POSN                        equ 0004h
BRGCON1_BRP4_POSITION                    equ 0004h
BRGCON1_BRP4_SIZE                        equ 0001h
BRGCON1_BRP4_LENGTH                      equ 0001h
BRGCON1_BRP4_MASK                        equ 0010h
BRGCON1_BRP5_POSN                        equ 0005h
BRGCON1_BRP5_POSITION                    equ 0005h
BRGCON1_BRP5_SIZE                        equ 0001h
BRGCON1_BRP5_LENGTH                      equ 0001h
BRGCON1_BRP5_MASK                        equ 0020h
BRGCON1_SJW0_POSN                        equ 0006h
BRGCON1_SJW0_POSITION                    equ 0006h
BRGCON1_SJW0_SIZE                        equ 0001h
BRGCON1_SJW0_LENGTH                      equ 0001h
BRGCON1_SJW0_MASK                        equ 0040h
BRGCON1_SJW1_POSN                        equ 0007h
BRGCON1_SJW1_POSITION                    equ 0007h
BRGCON1_SJW1_SIZE                        equ 0001h
BRGCON1_SJW1_LENGTH                      equ 0001h
BRGCON1_SJW1_MASK                        equ 0080h

// Register: BRGCON2
#define BRGCON2 BRGCON2
BRGCON2                                  equ 0F71h
// bitfield definitions
BRGCON2_PRSEG0_POSN                      equ 0000h
BRGCON2_PRSEG0_POSITION                  equ 0000h
BRGCON2_PRSEG0_SIZE                      equ 0001h
BRGCON2_PRSEG0_LENGTH                    equ 0001h
BRGCON2_PRSEG0_MASK                      equ 0001h
BRGCON2_PRSEG1_POSN                      equ 0001h
BRGCON2_PRSEG1_POSITION                  equ 0001h
BRGCON2_PRSEG1_SIZE                      equ 0001h
BRGCON2_PRSEG1_LENGTH                    equ 0001h
BRGCON2_PRSEG1_MASK                      equ 0002h
BRGCON2_PRSEG2_POSN                      equ 0002h
BRGCON2_PRSEG2_POSITION                  equ 0002h
BRGCON2_PRSEG2_SIZE                      equ 0001h
BRGCON2_PRSEG2_LENGTH                    equ 0001h
BRGCON2_PRSEG2_MASK                      equ 0004h
BRGCON2_SEG1PH0_POSN                     equ 0003h
BRGCON2_SEG1PH0_POSITION                 equ 0003h
BRGCON2_SEG1PH0_SIZE                     equ 0001h
BRGCON2_SEG1PH0_LENGTH                   equ 0001h
BRGCON2_SEG1PH0_MASK                     equ 0008h
BRGCON2_SEG1PH1_POSN                     equ 0004h
BRGCON2_SEG1PH1_POSITION                 equ 0004h
BRGCON2_SEG1PH1_SIZE                     equ 0001h
BRGCON2_SEG1PH1_LENGTH                   equ 0001h
BRGCON2_SEG1PH1_MASK                     equ 0010h
BRGCON2_SEG1PH2_POSN                     equ 0005h
BRGCON2_SEG1PH2_POSITION                 equ 0005h
BRGCON2_SEG1PH2_SIZE                     equ 0001h
BRGCON2_SEG1PH2_LENGTH                   equ 0001h
BRGCON2_SEG1PH2_MASK                     equ 0020h
BRGCON2_SAM_POSN                         equ 0006h
BRGCON2_SAM_POSITION                     equ 0006h
BRGCON2_SAM_SIZE                         equ 0001h
BRGCON2_SAM_LENGTH                       equ 0001h
BRGCON2_SAM_MASK                         equ 0040h
BRGCON2_SEG2PHTS_POSN                    equ 0007h
BRGCON2_SEG2PHTS_POSITION                equ 0007h
BRGCON2_SEG2PHTS_SIZE                    equ 0001h
BRGCON2_SEG2PHTS_LENGTH                  equ 0001h
BRGCON2_SEG2PHTS_MASK                    equ 0080h
BRGCON2_SEG2PHT_POSN                     equ 0007h
BRGCON2_SEG2PHT_POSITION                 equ 0007h
BRGCON2_SEG2PHT_SIZE                     equ 0001h
BRGCON2_SEG2PHT_LENGTH                   equ 0001h
BRGCON2_SEG2PHT_MASK                     equ 0080h

// Register: BRGCON3
#define BRGCON3 BRGCON3
BRGCON3                                  equ 0F72h
// bitfield definitions
BRGCON3_SEG2PH0_POSN                     equ 0000h
BRGCON3_SEG2PH0_POSITION                 equ 0000h
BRGCON3_SEG2PH0_SIZE                     equ 0001h
BRGCON3_SEG2PH0_LENGTH                   equ 0001h
BRGCON3_SEG2PH0_MASK                     equ 0001h
BRGCON3_SEG2PH1_POSN                     equ 0001h
BRGCON3_SEG2PH1_POSITION                 equ 0001h
BRGCON3_SEG2PH1_SIZE                     equ 0001h
BRGCON3_SEG2PH1_LENGTH                   equ 0001h
BRGCON3_SEG2PH1_MASK                     equ 0002h
BRGCON3_SEG2PH2_POSN                     equ 0002h
BRGCON3_SEG2PH2_POSITION                 equ 0002h
BRGCON3_SEG2PH2_SIZE                     equ 0001h
BRGCON3_SEG2PH2_LENGTH                   equ 0001h
BRGCON3_SEG2PH2_MASK                     equ 0004h
BRGCON3_WAKFIL_POSN                      equ 0006h
BRGCON3_WAKFIL_POSITION                  equ 0006h
BRGCON3_WAKFIL_SIZE                      equ 0001h
BRGCON3_WAKFIL_LENGTH                    equ 0001h
BRGCON3_WAKFIL_MASK                      equ 0040h

// Register: CIOCON
#define CIOCON CIOCON
CIOCON                                   equ 0F73h
// bitfield definitions
CIOCON_CANCAP_POSN                       equ 0004h
CIOCON_CANCAP_POSITION                   equ 0004h
CIOCON_CANCAP_SIZE                       equ 0001h
CIOCON_CANCAP_LENGTH                     equ 0001h
CIOCON_CANCAP_MASK                       equ 0010h
CIOCON_ENDRHI_POSN                       equ 0005h
CIOCON_ENDRHI_POSITION                   equ 0005h
CIOCON_ENDRHI_SIZE                       equ 0001h
CIOCON_ENDRHI_LENGTH                     equ 0001h
CIOCON_ENDRHI_MASK                       equ 0020h
CIOCON_TX1EN_POSN                        equ 0006h
CIOCON_TX1EN_POSITION                    equ 0006h
CIOCON_TX1EN_SIZE                        equ 0001h
CIOCON_TX1EN_LENGTH                      equ 0001h
CIOCON_TX1EN_MASK                        equ 0040h
CIOCON_TX1SRC_POSN                       equ 0007h
CIOCON_TX1SRC_POSITION                   equ 0007h
CIOCON_TX1SRC_SIZE                       equ 0001h
CIOCON_TX1SRC_LENGTH                     equ 0001h
CIOCON_TX1SRC_MASK                       equ 0080h
CIOCON_TX2EN_POSN                        equ 0006h
CIOCON_TX2EN_POSITION                    equ 0006h
CIOCON_TX2EN_SIZE                        equ 0001h
CIOCON_TX2EN_LENGTH                      equ 0001h
CIOCON_TX2EN_MASK                        equ 0040h
CIOCON_TX2SRC_POSN                       equ 0007h
CIOCON_TX2SRC_POSITION                   equ 0007h
CIOCON_TX2SRC_SIZE                       equ 0001h
CIOCON_TX2SRC_LENGTH                     equ 0001h
CIOCON_TX2SRC_MASK                       equ 0080h

// Register: COMSTAT
#define COMSTAT COMSTAT
COMSTAT                                  equ 0F74h
// bitfield definitions
COMSTAT_EWARN_POSN                       equ 0000h
COMSTAT_EWARN_POSITION                   equ 0000h
COMSTAT_EWARN_SIZE                       equ 0001h
COMSTAT_EWARN_LENGTH                     equ 0001h
COMSTAT_EWARN_MASK                       equ 0001h
COMSTAT_RXWARN_POSN                      equ 0001h
COMSTAT_RXWARN_POSITION                  equ 0001h
COMSTAT_RXWARN_SIZE                      equ 0001h
COMSTAT_RXWARN_LENGTH                    equ 0001h
COMSTAT_RXWARN_MASK                      equ 0002h
COMSTAT_TXWARN_POSN                      equ 0002h
COMSTAT_TXWARN_POSITION                  equ 0002h
COMSTAT_TXWARN_SIZE                      equ 0001h
COMSTAT_TXWARN_LENGTH                    equ 0001h
COMSTAT_TXWARN_MASK                      equ 0004h
COMSTAT_RXBP_POSN                        equ 0003h
COMSTAT_RXBP_POSITION                    equ 0003h
COMSTAT_RXBP_SIZE                        equ 0001h
COMSTAT_RXBP_LENGTH                      equ 0001h
COMSTAT_RXBP_MASK                        equ 0008h
COMSTAT_TXBP_POSN                        equ 0004h
COMSTAT_TXBP_POSITION                    equ 0004h
COMSTAT_TXBP_SIZE                        equ 0001h
COMSTAT_TXBP_LENGTH                      equ 0001h
COMSTAT_TXBP_MASK                        equ 0010h
COMSTAT_TXBO_POSN                        equ 0005h
COMSTAT_TXBO_POSITION                    equ 0005h
COMSTAT_TXBO_SIZE                        equ 0001h
COMSTAT_TXBO_LENGTH                      equ 0001h
COMSTAT_TXBO_MASK                        equ 0020h
COMSTAT_RXB1OVFL_POSN                    equ 0006h
COMSTAT_RXB1OVFL_POSITION                equ 0006h
COMSTAT_RXB1OVFL_SIZE                    equ 0001h
COMSTAT_RXB1OVFL_LENGTH                  equ 0001h
COMSTAT_RXB1OVFL_MASK                    equ 0040h
COMSTAT_RXB0OVFL_POSN                    equ 0007h
COMSTAT_RXB0OVFL_POSITION                equ 0007h
COMSTAT_RXB0OVFL_SIZE                    equ 0001h
COMSTAT_RXB0OVFL_LENGTH                  equ 0001h
COMSTAT_RXB0OVFL_MASK                    equ 0080h
COMSTAT_RX1OVFL_POSN                     equ 0006h
COMSTAT_RX1OVFL_POSITION                 equ 0006h
COMSTAT_RX1OVFL_SIZE                     equ 0001h
COMSTAT_RX1OVFL_LENGTH                   equ 0001h
COMSTAT_RX1OVFL_MASK                     equ 0040h
COMSTAT_RX0OVFL_POSN                     equ 0007h
COMSTAT_RX0OVFL_POSITION                 equ 0007h
COMSTAT_RX0OVFL_SIZE                     equ 0001h
COMSTAT_RX0OVFL_LENGTH                   equ 0001h
COMSTAT_RX0OVFL_MASK                     equ 0080h
COMSTAT_RXBNOVFL_POSN                    equ 0006h
COMSTAT_RXBNOVFL_POSITION                equ 0006h
COMSTAT_RXBNOVFL_SIZE                    equ 0001h
COMSTAT_RXBNOVFL_LENGTH                  equ 0001h
COMSTAT_RXBNOVFL_MASK                    equ 0040h
COMSTAT_FIFOEMPTY_POSN                   equ 0007h
COMSTAT_FIFOEMPTY_POSITION               equ 0007h
COMSTAT_FIFOEMPTY_SIZE                   equ 0001h
COMSTAT_FIFOEMPTY_LENGTH                 equ 0001h
COMSTAT_FIFOEMPTY_MASK                   equ 0080h

// Register: RXERRCNT
#define RXERRCNT RXERRCNT
RXERRCNT                                 equ 0F75h
// bitfield definitions
RXERRCNT_REC0_POSN                       equ 0000h
RXERRCNT_REC0_POSITION                   equ 0000h
RXERRCNT_REC0_SIZE                       equ 0001h
RXERRCNT_REC0_LENGTH                     equ 0001h
RXERRCNT_REC0_MASK                       equ 0001h
RXERRCNT_REC1_POSN                       equ 0001h
RXERRCNT_REC1_POSITION                   equ 0001h
RXERRCNT_REC1_SIZE                       equ 0001h
RXERRCNT_REC1_LENGTH                     equ 0001h
RXERRCNT_REC1_MASK                       equ 0002h
RXERRCNT_REC2_POSN                       equ 0002h
RXERRCNT_REC2_POSITION                   equ 0002h
RXERRCNT_REC2_SIZE                       equ 0001h
RXERRCNT_REC2_LENGTH                     equ 0001h
RXERRCNT_REC2_MASK                       equ 0004h
RXERRCNT_REC3_POSN                       equ 0003h
RXERRCNT_REC3_POSITION                   equ 0003h
RXERRCNT_REC3_SIZE                       equ 0001h
RXERRCNT_REC3_LENGTH                     equ 0001h
RXERRCNT_REC3_MASK                       equ 0008h
RXERRCNT_REC4_POSN                       equ 0004h
RXERRCNT_REC4_POSITION                   equ 0004h
RXERRCNT_REC4_SIZE                       equ 0001h
RXERRCNT_REC4_LENGTH                     equ 0001h
RXERRCNT_REC4_MASK                       equ 0010h
RXERRCNT_REC5_POSN                       equ 0005h
RXERRCNT_REC5_POSITION                   equ 0005h
RXERRCNT_REC5_SIZE                       equ 0001h
RXERRCNT_REC5_LENGTH                     equ 0001h
RXERRCNT_REC5_MASK                       equ 0020h
RXERRCNT_REC6_POSN                       equ 0006h
RXERRCNT_REC6_POSITION                   equ 0006h
RXERRCNT_REC6_SIZE                       equ 0001h
RXERRCNT_REC6_LENGTH                     equ 0001h
RXERRCNT_REC6_MASK                       equ 0040h
RXERRCNT_REC7_POSN                       equ 0007h
RXERRCNT_REC7_POSITION                   equ 0007h
RXERRCNT_REC7_SIZE                       equ 0001h
RXERRCNT_REC7_LENGTH                     equ 0001h
RXERRCNT_REC7_MASK                       equ 0080h

// Register: TXERRCNT
#define TXERRCNT TXERRCNT
TXERRCNT                                 equ 0F76h
// bitfield definitions
TXERRCNT_TEC0_POSN                       equ 0000h
TXERRCNT_TEC0_POSITION                   equ 0000h
TXERRCNT_TEC0_SIZE                       equ 0001h
TXERRCNT_TEC0_LENGTH                     equ 0001h
TXERRCNT_TEC0_MASK                       equ 0001h
TXERRCNT_TEC1_POSN                       equ 0001h
TXERRCNT_TEC1_POSITION                   equ 0001h
TXERRCNT_TEC1_SIZE                       equ 0001h
TXERRCNT_TEC1_LENGTH                     equ 0001h
TXERRCNT_TEC1_MASK                       equ 0002h
TXERRCNT_TEC2_POSN                       equ 0002h
TXERRCNT_TEC2_POSITION                   equ 0002h
TXERRCNT_TEC2_SIZE                       equ 0001h
TXERRCNT_TEC2_LENGTH                     equ 0001h
TXERRCNT_TEC2_MASK                       equ 0004h
TXERRCNT_TEC3_POSN                       equ 0003h
TXERRCNT_TEC3_POSITION                   equ 0003h
TXERRCNT_TEC3_SIZE                       equ 0001h
TXERRCNT_TEC3_LENGTH                     equ 0001h
TXERRCNT_TEC3_MASK                       equ 0008h
TXERRCNT_TEC4_POSN                       equ 0004h
TXERRCNT_TEC4_POSITION                   equ 0004h
TXERRCNT_TEC4_SIZE                       equ 0001h
TXERRCNT_TEC4_LENGTH                     equ 0001h
TXERRCNT_TEC4_MASK                       equ 0010h
TXERRCNT_TEC5_POSN                       equ 0005h
TXERRCNT_TEC5_POSITION                   equ 0005h
TXERRCNT_TEC5_SIZE                       equ 0001h
TXERRCNT_TEC5_LENGTH                     equ 0001h
TXERRCNT_TEC5_MASK                       equ 0020h
TXERRCNT_TEC6_POSN                       equ 0006h
TXERRCNT_TEC6_POSITION                   equ 0006h
TXERRCNT_TEC6_SIZE                       equ 0001h
TXERRCNT_TEC6_LENGTH                     equ 0001h
TXERRCNT_TEC6_MASK                       equ 0040h
TXERRCNT_TEC7_POSN                       equ 0007h
TXERRCNT_TEC7_POSITION                   equ 0007h
TXERRCNT_TEC7_SIZE                       equ 0001h
TXERRCNT_TEC7_LENGTH                     equ 0001h
TXERRCNT_TEC7_MASK                       equ 0080h

// Register: PORTK
#define PORTK PORTK
PORTK                                    equ 0F7Dh
// bitfield definitions
PORTK_RK0_POSN                           equ 0000h
PORTK_RK0_POSITION                       equ 0000h
PORTK_RK0_SIZE                           equ 0001h
PORTK_RK0_LENGTH                         equ 0001h
PORTK_RK0_MASK                           equ 0001h
PORTK_RK1_POSN                           equ 0001h
PORTK_RK1_POSITION                       equ 0001h
PORTK_RK1_SIZE                           equ 0001h
PORTK_RK1_LENGTH                         equ 0001h
PORTK_RK1_MASK                           equ 0002h
PORTK_RK2_POSN                           equ 0002h
PORTK_RK2_POSITION                       equ 0002h
PORTK_RK2_SIZE                           equ 0001h
PORTK_RK2_LENGTH                         equ 0001h
PORTK_RK2_MASK                           equ 0004h
PORTK_RK3_POSN                           equ 0003h
PORTK_RK3_POSITION                       equ 0003h
PORTK_RK3_SIZE                           equ 0001h
PORTK_RK3_LENGTH                         equ 0001h
PORTK_RK3_MASK                           equ 0008h
PORTK_RK4_POSN                           equ 0004h
PORTK_RK4_POSITION                       equ 0004h
PORTK_RK4_SIZE                           equ 0001h
PORTK_RK4_LENGTH                         equ 0001h
PORTK_RK4_MASK                           equ 0010h
PORTK_RK5_POSN                           equ 0005h
PORTK_RK5_POSITION                       equ 0005h
PORTK_RK5_SIZE                           equ 0001h
PORTK_RK5_LENGTH                         equ 0001h
PORTK_RK5_MASK                           equ 0020h
PORTK_RK6_POSN                           equ 0006h
PORTK_RK6_POSITION                       equ 0006h
PORTK_RK6_SIZE                           equ 0001h
PORTK_RK6_LENGTH                         equ 0001h
PORTK_RK6_MASK                           equ 0040h
PORTK_RK7_POSN                           equ 0007h
PORTK_RK7_POSITION                       equ 0007h
PORTK_RK7_SIZE                           equ 0001h
PORTK_RK7_LENGTH                         equ 0001h
PORTK_RK7_MASK                           equ 0080h

// Register: LATK
#define LATK LATK
LATK                                     equ 0F7Eh
// bitfield definitions
LATK_LATK0_POSN                          equ 0000h
LATK_LATK0_POSITION                      equ 0000h
LATK_LATK0_SIZE                          equ 0001h
LATK_LATK0_LENGTH                        equ 0001h
LATK_LATK0_MASK                          equ 0001h
LATK_LATK1_POSN                          equ 0001h
LATK_LATK1_POSITION                      equ 0001h
LATK_LATK1_SIZE                          equ 0001h
LATK_LATK1_LENGTH                        equ 0001h
LATK_LATK1_MASK                          equ 0002h
LATK_LATK2_POSN                          equ 0002h
LATK_LATK2_POSITION                      equ 0002h
LATK_LATK2_SIZE                          equ 0001h
LATK_LATK2_LENGTH                        equ 0001h
LATK_LATK2_MASK                          equ 0004h
LATK_LATK3_POSN                          equ 0003h
LATK_LATK3_POSITION                      equ 0003h
LATK_LATK3_SIZE                          equ 0001h
LATK_LATK3_LENGTH                        equ 0001h
LATK_LATK3_MASK                          equ 0008h
LATK_LATK4_POSN                          equ 0004h
LATK_LATK4_POSITION                      equ 0004h
LATK_LATK4_SIZE                          equ 0001h
LATK_LATK4_LENGTH                        equ 0001h
LATK_LATK4_MASK                          equ 0010h
LATK_LATK5_POSN                          equ 0005h
LATK_LATK5_POSITION                      equ 0005h
LATK_LATK5_SIZE                          equ 0001h
LATK_LATK5_LENGTH                        equ 0001h
LATK_LATK5_MASK                          equ 0020h
LATK_LATK6_POSN                          equ 0006h
LATK_LATK6_POSITION                      equ 0006h
LATK_LATK6_SIZE                          equ 0001h
LATK_LATK6_LENGTH                        equ 0001h
LATK_LATK6_MASK                          equ 0040h
LATK_LATK7_POSN                          equ 0007h
LATK_LATK7_POSITION                      equ 0007h
LATK_LATK7_SIZE                          equ 0001h
LATK_LATK7_LENGTH                        equ 0001h
LATK_LATK7_MASK                          equ 0080h
LATK_LK0_POSN                            equ 0000h
LATK_LK0_POSITION                        equ 0000h
LATK_LK0_SIZE                            equ 0001h
LATK_LK0_LENGTH                          equ 0001h
LATK_LK0_MASK                            equ 0001h
LATK_LK1_POSN                            equ 0001h
LATK_LK1_POSITION                        equ 0001h
LATK_LK1_SIZE                            equ 0001h
LATK_LK1_LENGTH                          equ 0001h
LATK_LK1_MASK                            equ 0002h
LATK_LK2_POSN                            equ 0002h
LATK_LK2_POSITION                        equ 0002h
LATK_LK2_SIZE                            equ 0001h
LATK_LK2_LENGTH                          equ 0001h
LATK_LK2_MASK                            equ 0004h
LATK_LK3_POSN                            equ 0003h
LATK_LK3_POSITION                        equ 0003h
LATK_LK3_SIZE                            equ 0001h
LATK_LK3_LENGTH                          equ 0001h
LATK_LK3_MASK                            equ 0008h
LATK_LK4_POSN                            equ 0004h
LATK_LK4_POSITION                        equ 0004h
LATK_LK4_SIZE                            equ 0001h
LATK_LK4_LENGTH                          equ 0001h
LATK_LK4_MASK                            equ 0010h
LATK_LK5_POSN                            equ 0005h
LATK_LK5_POSITION                        equ 0005h
LATK_LK5_SIZE                            equ 0001h
LATK_LK5_LENGTH                          equ 0001h
LATK_LK5_MASK                            equ 0020h
LATK_LK6_POSN                            equ 0006h
LATK_LK6_POSITION                        equ 0006h
LATK_LK6_SIZE                            equ 0001h
LATK_LK6_LENGTH                          equ 0001h
LATK_LK6_MASK                            equ 0040h
LATK_LK7_POSN                            equ 0007h
LATK_LK7_POSITION                        equ 0007h
LATK_LK7_SIZE                            equ 0001h
LATK_LK7_LENGTH                          equ 0001h
LATK_LK7_MASK                            equ 0080h

