GopalSaraf/Practicals/PSDL/include/proc/pic18c858.inc
// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0FA0h
// bitfield definitions
PIE2_CCP2IE_POSN                         equ 0000h
PIE2_CCP2IE_POSITION                     equ 0000h
PIE2_CCP2IE_SIZE                         equ 0001h
PIE2_CCP2IE_LENGTH                       equ 0001h
PIE2_CCP2IE_MASK                         equ 0001h
PIE2_TMR3IE_POSN                         equ 0001h
PIE2_TMR3IE_POSITION                     equ 0001h
PIE2_TMR3IE_SIZE                         equ 0001h
PIE2_TMR3IE_LENGTH                       equ 0001h
PIE2_TMR3IE_MASK                         equ 0002h
PIE2_LVDIE_POSN                          equ 0002h
PIE2_LVDIE_POSITION                      equ 0002h
PIE2_LVDIE_SIZE                          equ 0001h
PIE2_LVDIE_LENGTH                        equ 0001h
PIE2_LVDIE_MASK                          equ 0004h
PIE2_BCLIE_POSN                          equ 0003h
PIE2_BCLIE_POSITION                      equ 0003h
PIE2_BCLIE_SIZE                          equ 0001h
PIE2_BCLIE_LENGTH                        equ 0001h
PIE2_BCLIE_MASK                          equ 0008h
PIE2_CMIE_POSN                           equ 0006h
PIE2_CMIE_POSITION                       equ 0006h
PIE2_CMIE_SIZE                           equ 0001h
PIE2_CMIE_LENGTH                         equ 0001h
PIE2_CMIE_MASK                           equ 0040h

// Register: PIR2
#define PIR2 PIR2
PIR2                                     equ 0FA1h
// bitfield definitions
PIR2_CCP2IF_POSN                         equ 0000h
PIR2_CCP2IF_POSITION                     equ 0000h
PIR2_CCP2IF_SIZE                         equ 0001h
PIR2_CCP2IF_LENGTH                       equ 0001h
PIR2_CCP2IF_MASK                         equ 0001h
PIR2_TMR3IF_POSN                         equ 0001h
PIR2_TMR3IF_POSITION                     equ 0001h
PIR2_TMR3IF_SIZE                         equ 0001h
PIR2_TMR3IF_LENGTH                       equ 0001h
PIR2_TMR3IF_MASK                         equ 0002h
PIR2_LVDIF_POSN                          equ 0002h
PIR2_LVDIF_POSITION                      equ 0002h
PIR2_LVDIF_SIZE                          equ 0001h
PIR2_LVDIF_LENGTH                        equ 0001h
PIR2_LVDIF_MASK                          equ 0004h
PIR2_BCLIF_POSN                          equ 0003h
PIR2_BCLIF_POSITION                      equ 0003h
PIR2_BCLIF_SIZE                          equ 0001h
PIR2_BCLIF_LENGTH                        equ 0001h
PIR2_BCLIF_MASK                          equ 0008h
PIR2_CMIF_POSN                           equ 0006h
PIR2_CMIF_POSITION                       equ 0006h
PIR2_CMIF_SIZE                           equ 0001h
PIR2_CMIF_LENGTH                         equ 0001h
PIR2_CMIF_MASK                           equ 0040h

// Register: IPR2
#define IPR2 IPR2
IPR2                                     equ 0FA2h
// bitfield definitions
IPR2_CCP2IP_POSN                         equ 0000h
IPR2_CCP2IP_POSITION                     equ 0000h
IPR2_CCP2IP_SIZE                         equ 0001h
IPR2_CCP2IP_LENGTH                       equ 0001h
IPR2_CCP2IP_MASK                         equ 0001h
IPR2_TMR3IP_POSN                         equ 0001h
IPR2_TMR3IP_POSITION                     equ 0001h
IPR2_TMR3IP_SIZE                         equ 0001h
IPR2_TMR3IP_LENGTH                       equ 0001h
IPR2_TMR3IP_MASK                         equ 0002h
IPR2_LVDIP_POSN                          equ 0002h
IPR2_LVDIP_POSITION                      equ 0002h
IPR2_LVDIP_SIZE                          equ 0001h
IPR2_LVDIP_LENGTH                        equ 0001h
IPR2_LVDIP_MASK                          equ 0004h
IPR2_BCLIP_POSN                          equ 0003h
IPR2_BCLIP_POSITION                      equ 0003h
IPR2_BCLIP_SIZE                          equ 0001h
IPR2_BCLIP_LENGTH                        equ 0001h
IPR2_BCLIP_MASK                          equ 0008h
IPR2_CMIP_POSN                           equ 0006h
IPR2_CMIP_POSITION                       equ 0006h
IPR2_CMIP_SIZE                           equ 0001h
IPR2_CMIP_LENGTH                         equ 0001h
IPR2_CMIP_MASK                           equ 0040h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 0FA3h
// bitfield definitions
PIE3_RXB0IE_POSN                         equ 0000h
PIE3_RXB0IE_POSITION                     equ 0000h
PIE3_RXB0IE_SIZE                         equ 0001h
PIE3_RXB0IE_LENGTH                       equ 0001h
PIE3_RXB0IE_MASK                         equ 0001h
PIE3_RXB1IE_POSN                         equ 0001h
PIE3_RXB1IE_POSITION                     equ 0001h
PIE3_RXB1IE_SIZE                         equ 0001h
PIE3_RXB1IE_LENGTH                       equ 0001h
PIE3_RXB1IE_MASK                         equ 0002h
PIE3_TXB0IE_POSN                         equ 0002h
PIE3_TXB0IE_POSITION                     equ 0002h
PIE3_TXB0IE_SIZE                         equ 0001h
PIE3_TXB0IE_LENGTH                       equ 0001h
PIE3_TXB0IE_MASK                         equ 0004h
PIE3_TXB1IE_POSN                         equ 0003h
PIE3_TXB1IE_POSITION                     equ 0003h
PIE3_TXB1IE_SIZE                         equ 0001h
PIE3_TXB1IE_LENGTH                       equ 0001h
PIE3_TXB1IE_MASK                         equ 0008h
PIE3_TXB2IE_POSN                         equ 0004h
PIE3_TXB2IE_POSITION                     equ 0004h
PIE3_TXB2IE_SIZE                         equ 0001h
PIE3_TXB2IE_LENGTH                       equ 0001h
PIE3_TXB2IE_MASK                         equ 0010h
PIE3_ERRIE_POSN                          equ 0005h
PIE3_ERRIE_POSITION                      equ 0005h
PIE3_ERRIE_SIZE                          equ 0001h
PIE3_ERRIE_LENGTH                        equ 0001h
PIE3_ERRIE_MASK                          equ 0020h
PIE3_WAKIE_POSN                          equ 0006h
PIE3_WAKIE_POSITION                      equ 0006h
PIE3_WAKIE_SIZE                          equ 0001h
PIE3_WAKIE_LENGTH                        equ 0001h
PIE3_WAKIE_MASK                          equ 0040h
PIE3_IRXIE_POSN                          equ 0007h
PIE3_IRXIE_POSITION                      equ 0007h
PIE3_IRXIE_SIZE                          equ 0001h
PIE3_IRXIE_LENGTH                        equ 0001h
PIE3_IRXIE_MASK                          equ 0080h
PIE3_RXBNIE_POSN                         equ 0001h
PIE3_RXBNIE_POSITION                     equ 0001h
PIE3_RXBNIE_SIZE                         equ 0001h
PIE3_RXBNIE_LENGTH                       equ 0001h
PIE3_RXBNIE_MASK                         equ 0002h
PIE3_TXBNIE_POSN                         equ 0004h
PIE3_TXBNIE_POSITION                     equ 0004h
PIE3_TXBNIE_SIZE                         equ 0001h
PIE3_TXBNIE_LENGTH                       equ 0001h
PIE3_TXBNIE_MASK                         equ 0010h

// Register: PIR3
#define PIR3 PIR3
PIR3                                     equ 0FA4h
// bitfield definitions
PIR3_RXB0IF_POSN                         equ 0000h
PIR3_RXB0IF_POSITION                     equ 0000h
PIR3_RXB0IF_SIZE                         equ 0001h
PIR3_RXB0IF_LENGTH                       equ 0001h
PIR3_RXB0IF_MASK                         equ 0001h
PIR3_RXB1IF_POSN                         equ 0001h
PIR3_RXB1IF_POSITION                     equ 0001h
PIR3_RXB1IF_SIZE                         equ 0001h
PIR3_RXB1IF_LENGTH                       equ 0001h
PIR3_RXB1IF_MASK                         equ 0002h
PIR3_TXB0IF_POSN                         equ 0002h
PIR3_TXB0IF_POSITION                     equ 0002h
PIR3_TXB0IF_SIZE                         equ 0001h
PIR3_TXB0IF_LENGTH                       equ 0001h
PIR3_TXB0IF_MASK                         equ 0004h
PIR3_TXB1IF_POSN                         equ 0003h
PIR3_TXB1IF_POSITION                     equ 0003h
PIR3_TXB1IF_SIZE                         equ 0001h
PIR3_TXB1IF_LENGTH                       equ 0001h
PIR3_TXB1IF_MASK                         equ 0008h
PIR3_TXB2IF_POSN                         equ 0004h
PIR3_TXB2IF_POSITION                     equ 0004h
PIR3_TXB2IF_SIZE                         equ 0001h
PIR3_TXB2IF_LENGTH                       equ 0001h
PIR3_TXB2IF_MASK                         equ 0010h
PIR3_ERRIF_POSN                          equ 0005h
PIR3_ERRIF_POSITION                      equ 0005h
PIR3_ERRIF_SIZE                          equ 0001h
PIR3_ERRIF_LENGTH                        equ 0001h
PIR3_ERRIF_MASK                          equ 0020h
PIR3_WAKIF_POSN                          equ 0006h
PIR3_WAKIF_POSITION                      equ 0006h
PIR3_WAKIF_SIZE                          equ 0001h
PIR3_WAKIF_LENGTH                        equ 0001h
PIR3_WAKIF_MASK                          equ 0040h
PIR3_IRXIF_POSN                          equ 0007h
PIR3_IRXIF_POSITION                      equ 0007h
PIR3_IRXIF_SIZE                          equ 0001h
PIR3_IRXIF_LENGTH                        equ 0001h
PIR3_IRXIF_MASK                          equ 0080h
PIR3_RXBNIF_POSN                         equ 0001h
PIR3_RXBNIF_POSITION                     equ 0001h
PIR3_RXBNIF_SIZE                         equ 0001h
PIR3_RXBNIF_LENGTH                       equ 0001h
PIR3_RXBNIF_MASK                         equ 0002h
PIR3_TXBNIF_POSN                         equ 0004h
PIR3_TXBNIF_POSITION                     equ 0004h
PIR3_TXBNIF_SIZE                         equ 0001h
PIR3_TXBNIF_LENGTH                       equ 0001h
PIR3_TXBNIF_MASK                         equ 0010h

// Register: IPR3
#define IPR3 IPR3
IPR3                                     equ 0FA5h
// bitfield definitions
IPR3_RXB0IP_POSN                         equ 0000h
IPR3_RXB0IP_POSITION                     equ 0000h
IPR3_RXB0IP_SIZE                         equ 0001h
IPR3_RXB0IP_LENGTH                       equ 0001h
IPR3_RXB0IP_MASK                         equ 0001h
IPR3_RXB1IP_POSN                         equ 0001h
IPR3_RXB1IP_POSITION                     equ 0001h
IPR3_RXB1IP_SIZE                         equ 0001h
IPR3_RXB1IP_LENGTH                       equ 0001h
IPR3_RXB1IP_MASK                         equ 0002h
IPR3_TXB0IP_POSN                         equ 0002h
IPR3_TXB0IP_POSITION                     equ 0002h
IPR3_TXB0IP_SIZE                         equ 0001h
IPR3_TXB0IP_LENGTH                       equ 0001h
IPR3_TXB0IP_MASK                         equ 0004h
IPR3_TXB1IP_POSN                         equ 0003h
IPR3_TXB1IP_POSITION                     equ 0003h
IPR3_TXB1IP_SIZE                         equ 0001h
IPR3_TXB1IP_LENGTH                       equ 0001h
IPR3_TXB1IP_MASK                         equ 0008h
IPR3_TXB2IP_POSN                         equ 0004h
IPR3_TXB2IP_POSITION                     equ 0004h
IPR3_TXB2IP_SIZE                         equ 0001h
IPR3_TXB2IP_LENGTH                       equ 0001h
IPR3_TXB2IP_MASK                         equ 0010h
IPR3_ERRIP_POSN                          equ 0005h
IPR3_ERRIP_POSITION                      equ 0005h
IPR3_ERRIP_SIZE                          equ 0001h
IPR3_ERRIP_LENGTH                        equ 0001h
IPR3_ERRIP_MASK                          equ 0020h
IPR3_WAKIP_POSN                          equ 0006h
IPR3_WAKIP_POSITION                      equ 0006h
IPR3_WAKIP_SIZE                          equ 0001h
IPR3_WAKIP_LENGTH                        equ 0001h
IPR3_WAKIP_MASK                          equ 0040h
IPR3_IRXIP_POSN                          equ 0007h
IPR3_IRXIP_POSITION                      equ 0007h
IPR3_IRXIP_SIZE                          equ 0001h
IPR3_IRXIP_LENGTH                        equ 0001h
IPR3_IRXIP_MASK                          equ 0080h
IPR3_RXBNIP_POSN                         equ 0001h
IPR3_RXBNIP_POSITION                     equ 0001h
IPR3_RXBNIP_SIZE                         equ 0001h
IPR3_RXBNIP_LENGTH                       equ 0001h
IPR3_RXBNIP_MASK                         equ 0002h
IPR3_TXBNIP_POSN                         equ 0004h
IPR3_TXBNIP_POSITION                     equ 0004h
IPR3_TXBNIP_SIZE                         equ 0001h
IPR3_TXBNIP_LENGTH                       equ 0001h
IPR3_TXBNIP_MASK                         equ 0010h

