GopalSaraf/Practicals/PSDL/include/proc/pic18c858.inc
// Register: CVRCON
#define CVRCON CVRCON
CVRCON                                   equ 0FB5h
// bitfield definitions
CVRCON_VR_POSN                           equ 0000h
CVRCON_VR_POSITION                       equ 0000h
CVRCON_VR_SIZE                           equ 0004h
CVRCON_VR_LENGTH                         equ 0004h
CVRCON_VR_MASK                           equ 000Fh
CVRCON_VRSS_POSN                         equ 0004h
CVRCON_VRSS_POSITION                     equ 0004h
CVRCON_VRSS_SIZE                         equ 0001h
CVRCON_VRSS_LENGTH                       equ 0001h
CVRCON_VRSS_MASK                         equ 0010h
CVRCON_VRR_POSN                          equ 0005h
CVRCON_VRR_POSITION                      equ 0005h
CVRCON_VRR_SIZE                          equ 0001h
CVRCON_VRR_LENGTH                        equ 0001h
CVRCON_VRR_MASK                          equ 0020h
CVRCON_VROEN_POSN                        equ 0006h
CVRCON_VROEN_POSITION                    equ 0006h
CVRCON_VROEN_SIZE                        equ 0001h
CVRCON_VROEN_LENGTH                      equ 0001h
CVRCON_VROEN_MASK                        equ 0040h
CVRCON_VREN_POSN                         equ 0007h
CVRCON_VREN_POSITION                     equ 0007h
CVRCON_VREN_SIZE                         equ 0001h
CVRCON_VREN_LENGTH                       equ 0001h
CVRCON_VREN_MASK                         equ 0080h
CVRCON_VR0_POSN                          equ 0000h
CVRCON_VR0_POSITION                      equ 0000h
CVRCON_VR0_SIZE                          equ 0001h
CVRCON_VR0_LENGTH                        equ 0001h
CVRCON_VR0_MASK                          equ 0001h
CVRCON_VR1_POSN                          equ 0001h
CVRCON_VR1_POSITION                      equ 0001h
CVRCON_VR1_SIZE                          equ 0001h
CVRCON_VR1_LENGTH                        equ 0001h
CVRCON_VR1_MASK                          equ 0002h
CVRCON_VR2_POSN                          equ 0002h
CVRCON_VR2_POSITION                      equ 0002h
CVRCON_VR2_SIZE                          equ 0001h
CVRCON_VR2_LENGTH                        equ 0001h
CVRCON_VR2_MASK                          equ 0004h
CVRCON_VR3_POSN                          equ 0003h
CVRCON_VR3_POSITION                      equ 0003h
CVRCON_VR3_SIZE                          equ 0001h
CVRCON_VR3_LENGTH                        equ 0001h
CVRCON_VR3_MASK                          equ 0008h
CVRCON_CRR_POSN                          equ 0005h
CVRCON_CRR_POSITION                      equ 0005h
CVRCON_CRR_SIZE                          equ 0001h
CVRCON_CRR_LENGTH                        equ 0001h
CVRCON_CRR_MASK                          equ 0020h
CVRCON_VROE_POSN                         equ 0006h
CVRCON_VROE_POSITION                     equ 0006h
CVRCON_VROE_SIZE                         equ 0001h
CVRCON_VROE_LENGTH                       equ 0001h
CVRCON_VROE_MASK                         equ 0040h
CVRCON_CVREN_POSN                        equ 0007h
CVRCON_CVREN_POSITION                    equ 0007h
CVRCON_CVREN_SIZE                        equ 0001h
CVRCON_CVREN_LENGTH                      equ 0001h
CVRCON_CVREN_MASK                        equ 0080h
CVRCON_CVR0_POSN                         equ 0000h
CVRCON_CVR0_POSITION                     equ 0000h
CVRCON_CVR0_SIZE                         equ 0001h
CVRCON_CVR0_LENGTH                       equ 0001h
CVRCON_CVR0_MASK                         equ 0001h
CVRCON_CVR1_POSN                         equ 0001h
CVRCON_CVR1_POSITION                     equ 0001h
CVRCON_CVR1_SIZE                         equ 0001h
CVRCON_CVR1_LENGTH                       equ 0001h
CVRCON_CVR1_MASK                         equ 0002h
CVRCON_CVR2_POSN                         equ 0002h
CVRCON_CVR2_POSITION                     equ 0002h
CVRCON_CVR2_SIZE                         equ 0001h
CVRCON_CVR2_LENGTH                       equ 0001h
CVRCON_CVR2_MASK                         equ 0004h
CVRCON_CVR3_POSN                         equ 0003h
CVRCON_CVR3_POSITION                     equ 0003h
CVRCON_CVR3_SIZE                         equ 0001h
CVRCON_CVR3_LENGTH                       equ 0001h
CVRCON_CVR3_MASK                         equ 0008h
CVRCON_CVRSS_POSN                        equ 0004h
CVRCON_CVRSS_POSITION                    equ 0004h
CVRCON_CVRSS_SIZE                        equ 0001h
CVRCON_CVRSS_LENGTH                      equ 0001h
CVRCON_CVRSS_MASK                        equ 0010h
CVRCON_CVRR_POSN                         equ 0005h
CVRCON_CVRR_POSITION                     equ 0005h
CVRCON_CVRR_SIZE                         equ 0001h
CVRCON_CVRR_LENGTH                       equ 0001h
CVRCON_CVRR_MASK                         equ 0020h
CVRCON_CVROEN_POSN                       equ 0006h
CVRCON_CVROEN_POSITION                   equ 0006h
CVRCON_CVROEN_SIZE                       equ 0001h
CVRCON_CVROEN_LENGTH                     equ 0001h
CVRCON_CVROEN_MASK                       equ 0040h

// Register: CCP2CON
#define CCP2CON CCP2CON
CCP2CON                                  equ 0FBAh
// bitfield definitions
CCP2CON_CCP2M_POSN                       equ 0000h
CCP2CON_CCP2M_POSITION                   equ 0000h
CCP2CON_CCP2M_SIZE                       equ 0004h
CCP2CON_CCP2M_LENGTH                     equ 0004h
CCP2CON_CCP2M_MASK                       equ 000Fh
CCP2CON_DC2B_POSN                        equ 0004h
CCP2CON_DC2B_POSITION                    equ 0004h
CCP2CON_DC2B_SIZE                        equ 0002h
CCP2CON_DC2B_LENGTH                      equ 0002h
CCP2CON_DC2B_MASK                        equ 0030h
CCP2CON_CCP2M0_POSN                      equ 0000h
CCP2CON_CCP2M0_POSITION                  equ 0000h
CCP2CON_CCP2M0_SIZE                      equ 0001h
CCP2CON_CCP2M0_LENGTH                    equ 0001h
CCP2CON_CCP2M0_MASK                      equ 0001h
CCP2CON_CCP2M1_POSN                      equ 0001h
CCP2CON_CCP2M1_POSITION                  equ 0001h
CCP2CON_CCP2M1_SIZE                      equ 0001h
CCP2CON_CCP2M1_LENGTH                    equ 0001h
CCP2CON_CCP2M1_MASK                      equ 0002h
CCP2CON_CCP2M2_POSN                      equ 0002h
CCP2CON_CCP2M2_POSITION                  equ 0002h
CCP2CON_CCP2M2_SIZE                      equ 0001h
CCP2CON_CCP2M2_LENGTH                    equ 0001h
CCP2CON_CCP2M2_MASK                      equ 0004h
CCP2CON_CCP2M3_POSN                      equ 0003h
CCP2CON_CCP2M3_POSITION                  equ 0003h
CCP2CON_CCP2M3_SIZE                      equ 0001h
CCP2CON_CCP2M3_LENGTH                    equ 0001h
CCP2CON_CCP2M3_MASK                      equ 0008h
CCP2CON_DC2B0_POSN                       equ 0004h
CCP2CON_DC2B0_POSITION                   equ 0004h
CCP2CON_DC2B0_SIZE                       equ 0001h
CCP2CON_DC2B0_LENGTH                     equ 0001h
CCP2CON_DC2B0_MASK                       equ 0010h
CCP2CON_DC2B1_POSN                       equ 0005h
CCP2CON_DC2B1_POSITION                   equ 0005h
CCP2CON_DC2B1_SIZE                       equ 0001h
CCP2CON_DC2B1_LENGTH                     equ 0001h
CCP2CON_DC2B1_MASK                       equ 0020h
CCP2CON_CCPM3_POSN                       equ 0003h
CCP2CON_CCPM3_POSITION                   equ 0003h
CCP2CON_CCPM3_SIZE                       equ 0001h
CCP2CON_CCPM3_LENGTH                     equ 0001h
CCP2CON_CCPM3_MASK                       equ 0008h
CCP2CON_CCP2Y_POSN                       equ 0004h
CCP2CON_CCP2Y_POSITION                   equ 0004h
CCP2CON_CCP2Y_SIZE                       equ 0001h
CCP2CON_CCP2Y_LENGTH                     equ 0001h
CCP2CON_CCP2Y_MASK                       equ 0010h
CCP2CON_CCP2X_POSN                       equ 0005h
CCP2CON_CCP2X_POSITION                   equ 0005h
CCP2CON_CCP2X_SIZE                       equ 0001h
CCP2CON_CCP2X_LENGTH                     equ 0001h
CCP2CON_CCP2X_MASK                       equ 0020h
CCP2CON_DCCPX_POSN                       equ 0005h
CCP2CON_DCCPX_POSITION                   equ 0005h
CCP2CON_DCCPX_SIZE                       equ 0001h
CCP2CON_DCCPX_LENGTH                     equ 0001h
CCP2CON_DCCPX_MASK                       equ 0020h

// Register: CCPR2
#define CCPR2 CCPR2
CCPR2                                    equ 0FBBh

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 0FBBh

